#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrimLog/dev/runs/run-dUNyVHvjbsWuWy4Y

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_iam_policy.fargate_policy: Refreshing state... [id=arn:aws:iam::479401498383:policy/graphql-api-dev-fargate-policy]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=graphql-api-dev-execution-role]
aws_vpc.vpc: Refreshing state... [id=vpc-071c87c56b8eca1be]
data.aws_acm_certificate.cert: Refreshing...
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/graphql-api-dev]
aws_default_vpc.vpc: Refreshing state... [id=vpc-04a957e07df5e4290]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:479401498383:cluster/graphql-api-dev]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment1: Refreshing state... [id=graphql-api-dev-execution-role-20230419232626349200000002]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment2: Refreshing state... [id=graphql-api-dev-execution-role-20230419232626332000000001]
aws_ecs_task_definition.definition: Refreshing state... [id=graphql-api-dev-task]
data.aws_acm_certificate.cert: Refresh complete after 1s [id=arn:aws:acm:us-east-1:479401498383:certificate/71f48b3d-ceca-4b5f-bcb9-4b8055d23758]
aws_vpc_peering_connection.peering_connection: Refreshing state... [id=pcx-093ce57d2df3df5dd]
aws_internet_gateway.gw: Refreshing state... [id=igw-0ce407fc154b8cb2c]
aws_security_group.graphql_api: Refreshing state... [id=sg-091e4a09d3a5eaeec]
aws_default_security_group.default: Refreshing state... [id=sg-0fa73ffe645781826]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:479401498383:targetgroup/graphql-api-dev/5347bfb4422bb66c]
aws_subnet.subnet["us-east-1d"]: Refreshing state... [id=subnet-0cbd4d58eb64dbcb2]
aws_subnet.subnet["us-east-1b"]: Refreshing state... [id=subnet-070be33c50d6962da]
aws_security_group.web_everyone2: Refreshing state... [id=sg-09d11e5205916ea28]
aws_route.vpc_peering_route: Refreshing state... [id=r-rtb-023d93e86e836cb4b2811395018]
aws_default_route_table.default: Refreshing state... [id=rtb-0a657c4a4dd0540c7]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:479401498383:loadbalancer/app/graphql-api-dev-alb/b6f57001c89afb4a]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:479401498383:service/graphql-api-dev/graphql-api-dev-svc]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:479401498383:listener/app/graphql-api-dev-alb/b6f57001c89afb4a/9d6cbfda849869bc]
aws_ecs_task_definition.definition: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:479401498383:service/graphql-api-dev/graphql-api-dev-svc"
        name                               = "graphql-api-dev-svc"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:479401498383:task-definition/graphql-api-dev-task:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.definition must be replaced
-/+ resource "aws_ecs_task_definition" "definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:479401498383:task-definition/graphql-api-dev-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:479401498383:task-definition/graphql-api-dev-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "479401498383.dkr.ecr.us-east-1.amazonaws.com/graphql-api:7666a1ec2efb24db3a2e09a983dd5ae6ad121646" -> "479401498383.dkr.ecr.us-east-1.amazonaws.com/graphql-api:37cf0445937e276c3982c56430abad65556a2c26"
                    name             = "graphql-api-dev-container"
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "graphql-api-dev-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Environment: `dev`*